/// Раздел справочной информации
/////////////////////////////////
orpa_helper_info = function(key_str) {
    var title_str = orpa_helper_info_dict[key_str]["title_str"]
    var description_str = orpa_helper_info_dict[key_str]["description_str"]
    orpa_workspace_modal_show(title_str, description_str);
}

orpa_helper_info_dict={
    "orpa_desktop_ui_object": {
        "title_str": "Подсказка по разделу UI объектов",
        "description_str": "Одно из ключевых окон. Здесь можно исследовать структуру открытых приложений (их компонентов). Также здесь доступны такие опции как: Просмотр в виде дерева (кнопка 'Дерево') или в виде списка (кнопка 'Список'). В отношении каждого UI объекта доступны следующие действия: Подсветить UI объект, Поиск дочернего UI объекта с помощью мыши, Генерация UIO селектора, Развернуть дочерние UI объекты. Дополнительно (только в EE версии) можно воспользоваться универсальным поиском UI компонентов. Данный поиск ищет вхождение введенной текстовой строки в один или несколько атрибутов UI элемента. Допускается универсальный поиск в режимах STR (точное соответствие), WC (соответствие с использованием правил WildCard), RegExp (соответствие с использованием правил регулярных выражений)"
    },
    "orpa_desktop_level_info": {
        "title_str": "Подсказка по разделу уровней вложенности",
        "description_str": "Окно по просмотру уровней вложенности до UI объекта. Выбрать UI объект можно в разделе UI объектов с помощью мыши. Дополнительно (только в EE версии) можно воспользоваться функцией сохранения контекста экрана в слоты 1 - 4. Данная функция позволяет работать над роботизацией нескольких UI объектов одновременно."
    },
    "orpa_desktop_property_list": {
        "title_str": "Подсказка по разделу свойств",
        "description_str": "Окно просмотра свойств UI объекта. Выбор UI объекта производится с помощью указателя мыши в окне Уровней вложенности. Если в окне Селектор указан какой-то селектор, то окно свойств позволяет вносить правки в набор свойств селектора путем нажатия по соответствующему свойству."
    },
    "orpa_desktop_action_result": {
        "title_str": "Подсказка по разделу результатов",
        "description_str": "Окно просмотра результата выполнения действия, которое было выбрано в окне ДЕЙСТВИЕ."
    },
    "orpa_desktop_action_pane": {
        "title_str": "Подсказка по разделу действий",
        "description_str": "Окно активации действия / генерации Python кода. Доступны действия (функции) UI объектов, а также модуля pyOpenRPA.Robot.UIDesktop. В отношении всех выбранных действий доступна функция генерации Python кода (иконка </>). При нажатии, сгенерированный код Python помещается в буфер обмена. Далее этот код можно вставить в проект робота, например, на вкладке 'Проект'. Для функций поддерживается 2 формы ввода аргументов: в виде списка (кнопка СПИСОК) и в виде словаря (кнопка СЛОВАРЬ). Также панель действий поддерживает функциональность по просмотру свойств UI объектов. В случае выбора свойства поле Аргументы не будет доступно для ввода."
    },
    "orpa_desktop_selector": {
        "title_str": "Подсказка по разделу селектора",
        "description_str": "Окно формирования селектора (указателя на один или несколько UI объектов). Дополнительно (только в EE версии) поддерживается функциональность формирования селектора в форматах XPATH и CSS. Сформировать селектор автоматически можно с помощью соответсвующей кнопки в окне UI объекты."
    },
    
    "orpa_browser_ui_object": {
        "title_str": "Подсказка по разделу UI объектов",
        "description_str": "Одно из ключевых окон. Здесь можно исследовать структуру открытых приложений (их компонентов). Также здесь доступны такие опции как: Просмотр в виде дерева (кнопка 'Дерево') или в виде списка (кнопка 'Список'). В отношении каждого UI объекта доступны следующие действия: Подсветить UI объект, Поиск дочернего UI объекта с помощью мыши, Генерация UIO селектора, Развернуть дочерние UI объекты. Дополнительно (только в EE версии) можно воспользоваться универсальным поиском UI компонентов. Данный поиск ищет вхождение введенной текстовой строки в один или несколько атрибутов UI элемента. Допускается универсальный поиск в режимах STR (точное соответствие), WC (соответствие с использованием правил WildCard), RegExp (соответствие с использованием правил регулярных выражений)"
    },
    "orpa_browser_level_info": {
        "title_str": "Подсказка по разделу уровней вложенности",
        "description_str": "Окно по просмотру уровней вложенности до UI объекта. Выбрать UI объект можно в разделе UI объектов с помощью мыши. Дополнительно (только в EE версии) можно воспользоваться функцией сохранения контекста экрана в слоты 1 - 4. Данная функция позволяет работать над роботизацией нескольких UI объектов одновременно."
    },
    "orpa_browser_property_list": {
        "title_str": "Подсказка по разделу свойств",
        "description_str": "Окно просмотра свойств UI объекта. Выбор UI объекта производится с помощью указателя мыши в окне Уровней вложенности. Если в окне Селектор указан какой-то селектор, то окно свойств позволяет вносить правки в набор свойств селектора путем нажатия по соответствующему свойству."
    },
    "orpa_browser_action_result": {
        "title_str": "Подсказка по разделу результатов",
        "description_str": "Окно просмотра результата выполнения действия, которое было выбрано в окне ДЕЙСТВИЕ."
    },
    "orpa_browser_action_pane": {
        "title_str": "Подсказка по разделу действий",
        "description_str": "Окно активации действия / генерации Python кода. Доступны действия (функции) UI объектов, а также модуля pyOpenRPA.Robot.UIDesktop. В отношении всех выбранных действий доступна функция генерации Python кода (иконка </>). При нажатии, сгенерированный код Python помещается в буфер обмена. Далее этот код можно вставить в проект робота, например, на вкладке 'Проект'. Для функций поддерживается 2 формы ввода аргументов: в виде списка (кнопка СПИСОК) и в виде словаря (кнопка СЛОВАРЬ). Также панель действий поддерживает функциональность по просмотру свойств UI объектов. В случае выбора свойства поле Аргументы не будет доступно для ввода."
    },
    "orpa_browser_selector": {
        "title_str": "Подсказка по разделу селектора",
        "description_str": "Окно формирования селектора (указателя на один или несколько UI объектов). Дополнительно (только в EE версии) поддерживается функциональность формирования селектора в форматах XPATH и CSS. Сформировать селектор автоматически можно с помощью соответсвующей кнопки в окне UI объекты."
    }, 

    "orpa_keyboard_selector": {
        "title_str": "Подсказка по разделу селектора",
        "description_str": "Окно установки фокуса по UIO селектору. Данная функциональность позволяет применить методы клавиатуры по конкретному UI объекту. Сформировать селектор автоматически можно с помощью вкладки ПРИЛОЖЕНИЕ."
    },
    "orpa_keyboard_wait": {
        "title_str": "Подсказка по разделу ожидания",
        "description_str": "Окно установки задержки перед инициализацией функции клавиатуры. Данная функциональность позволяет установить фокус там, где требуется перед выполнением действия."
    },
    "orpa_keyboard_text": {
        "title_str": "Подсказка по разделу текст",
        "description_str": "Печать произвольного текста по локации, где установлен фокус. ВНИМАНИЕ! В одной строке поддерживает символы разных языков! Не зависит от текущей раскладки клавиатуры."
    },
    "orpa_keyboard_symbol": {
        "title_str": "Подсказка по разделу символа",
        "description_str": "Печать произвольного символа, где установлен фокус. ВНИМАНИЕ! Зависит от текущей раскладки клавиатуры."
    },
    "orpa_keyboard_hotkey": {
        "title_str": "Подсказка по разделу горячих клавиш",
        "description_str": "Инициация нажатия комбинации горячих клавиш. ВНИМАНИЕ! Не зависит от текущей раскладки клавиатуры."
    },

    "orpa_mouse_project": {
        "title_str": "Подсказка по разделу проекта",
        "description_str": "Данное окно отображает перечень всех изображений, обнаруженных в папке. Выбранные изображения можно: распознать, найти на экране, переименовать, удалить. Для создания изображения необходимо нажать кнопку ВЫРЕЗАТЬ"
    },
    "orpa_mouse_preview": {
        "title_str": "Подсказка по разделу предпросмотра",
        "description_str": "Окно просмотра изображения. Выбрать изображение можно в разделе ПРОЕКТ, путем нажатия по интересующему файлу."
    },
    "orpa_mouse_location": {
        "title_str": "Подсказка по разделу обнаруженных локаций",
        "description_str": "Окно позволяет идентифицировать количество обнаруженных изображений на экране рабочей станции."
    },
    "orpa_mouse_selector": {
        "title_str": "Подсказка по разделу селектора",
        "description_str": "Окно установки фокуса по UIO / XPATH / CSS селектору. Данная функциональность позволяет применить методы клавиатуры по конкретному UI объекту. Сформировать селектор автоматически можно с помощью вкладки ПРИЛОЖЕНИЕ."
    },
    "orpa_mouse_wait": {
        "title_str": "Подсказка по разделу ожидания",
        "description_str": "Окно установки задержки перед инициализацией функции клавиатуры. Данная функциональность позволяет установить фокус там, где требуется перед выполнением действия."
    },
    "orpa_mouse_action_pane": {
        "title_str": "Подсказка по разделу действий",
        "description_str": "Окно активации действия / генерации Python кода. Доступны действия (функции) UI объектов, а также модуля pyOpenRPA.Robot.UIDesktop. В отношении всех выбранных действий доступна функция генерации Python кода (иконка </>). При нажатии, сгенерированный код Python помещается в буфер обмена. Далее этот код можно вставить в проект робота, например, на вкладке 'Проект'. Для функций поддерживается 2 формы ввода аргументов: в виде списка (кнопка СПИСОК) и в виде словаря (кнопка СЛОВАРЬ). Также панель действий поддерживает функциональность по просмотру свойств UI объектов. В случае выбора свойства поле Аргументы не будет доступно для ввода."
    },
    "orpa_mouse_recognition": {
        "title_str": "Подсказка по разделу распознавания",
        "description_str": "Окно распознавания текста на изображении. Выбрать изображение можно с помощью кнопки РАСПОЗНАТЬ в разделе ПРОЕКТ, либо указать полный путь до интересующего файла изображения."
    }
}